emacs/lisp/helpful.org
#+title: Emacs — Packages — Making My Life Easier
#+setupfile: ../headers
#+property: header-args:emacs-lisp  :mkdirp yes :lexical t :exports code
#+property: header-args:emacs-lisp+ :tangle ~/.config/emacs/lisp/helpful.el
#+property: header-args:emacs-lisp+ :mkdirp yes :noweb no-export

* Making my life easier
** Bufler
Bufler is a package that organises and lists buffers in a much better way than how they are usually sorted. You can easily and quickly find buffers by their group, not only by their name, and THIS is great news! Also, no ~helm~ please! And for some reason, the keybindings are borked by default, so let’s redefine them, and let’s also rebind ~SPC~ to ~p~ since it would conflict with my main ~general~ prefix.

#+begin_src emacs-lisp
(use-package bufler
  :straight (bufler :build t
                    :files (:defaults (:exclude "helm-bufler.el")))
  :defer t
  :general
  (phundrak/evil
   :keymaps  'bufler-list-mode-map
   :packages 'bufler
   "?"   #'hydra:bufler/body
   "g"   #'bufler
   "f"   #'bufler-list-group-frame
   "F"   #'bufler-list-group-make-frame
   "N"   #'bufler-list-buffer-name-workspace
   "k"   #'bufler-list-buffer-kill
   "p"   #'bufler-list-buffer-peek
   "s"   #'bufler-list-buffer-save
   "RET" #'bufler-list-buffer-switch))
#+end_src

** Beancount

~beancount-mode~ an Emacs major-mode implementing syntax highlighting, indentation, completion , and other facilities to edit and work with Beancount ledger files.

Let's instruct Emacs to activate beancount-mode when opening files with a ~.beancount~ extension

#+begin_src emacs-lisp
  (use-package beancount
    :straight (:build t)
    :ensure t
    :mode (("\\.beancount\\'" . beancount-mode))
    :config
    ;; Optional: Add configuration settings here.
    ;; Example: Align numbers to a specific column
    (setq beancount-number-alignment-column 52)

    ;; Optional: Define custom keybindings, e.g. for inserting the current date
    ;; (global-set-key (kbd "C-c d") 'beancount-insert-date)

    ;; Ensure beancount executable is in the Emacs PATH for tools like bean-check
    (setenv "PATH" (concat (getenv "PATH") ":/Users/ewerlopes/coding/contas/.venv/bin"))
    (add-to-list 'exec-path "/Users/ewerlopes/coding/contas/.venv/bin")
  )
#+end_src
